import type {NextPage} from "next"

const bristles: NextPage = () => {
  return <div className={"prose lg:prose-xl min-w-[900px] max-w-[1000px] mx-auto"}>
    <div>
      摘要：数量性状也叫度量性状，是生物性状的一种类型，数量性状在群体内部不同个体上往往表现为连续的变异，多呈正态分布。为了探究数量性状遗传的特点与规律，并学会运用数理统计和数学分析方法解决实际问题，本实验利用黑腹果蝇腹板刚毛数来探究数量性状遗传规律，对数据进行了处理和作图，并作出拟合正态曲线，最后计算了刚毛数性状的实现遗传率。本班结果表明，亲代及子代果蝇腹部腹板刚毛数呈正态分布，高方向选择子代群体均值较亲本差值增加，低方向选择子代较亲本差值减少，而年级汇总结果却无法明显观察到此现象；雌性果蝇平均刚毛数大于雄性。因此，本实验验证了果蝇腹部腹板刚毛数性状符合数量遗传规律。最后对本实验进行了讨论和分析，并提出了减小实验误差的方法。
      关键词：黑腹果蝇；刚毛数；数量性状；正态分布；遗传率。

      1 引言
      黑腹果蝇（Drosophila melanogaster）广泛用于遗传学研究，属于果蝇科、果蝇属，是果蝇的代表物种。黑腹果蝇是双翅目昆虫，生活史短，生长迅速，在25℃条件下，10~12
      d即可完成一个世代；个体小，易饲养，繁殖快，突变形状多达400个以上，并且多数是形态变异，便于观察和统计分析；染色体数目少，突变基因容易在染色体上定位，因此，果蝇是一种很好的遗传学实验材料，是常用的模式生物[1]。黑腹果蝇雌性体长2.5毫米,
      雄性较之要小；雄性腹部有黑斑，4个腹片，3条黑色条纹，雌性有6个腹片，5条黑色条纹；雄性前肢有黑色鬃毛状性梳，而雌性没有, 可以此来作区别（图1A）。
      果蝇属于完全变态昆虫，生活史包括卵→幼虫→蛹→成虫（图1B）。雌果蝇羽化后12 h内不能交配，因此选取处女蝇必须在这12 h内进行。超过12 h开始交配，2
      d后开始产卵，雌蝇可以一次产下400个0.5毫米大小的卵，它们有绒毛膜和一层卵黄膜包被。其发育速度受环境温度影响。在25℃环境下，22 h后幼虫就会破壳而出。温度太高或太低都会影响发育的速度。果蝇的幼虫24
      h后就会第一次蜕皮，并且不断生长，以到达第二，第三幼体发育期。经过三个幼虫发育阶段和在25℃下五天的蛹期的变态发育，最后破蛹而出，成为成虫。当营养条件适宜时，在20℃下饲养，由卵至成虫期约需要15
      d；若在25℃下饲养，由卵至成虫期约需要10 d；当温度低至10℃时，果蝇的生活周期将延长至57 d以上，且生活力明显降低；如果温度高于30℃，将会引起不育和死亡，因此，果蝇培养的最适温度为20~25℃。
      在生物中，有些性状可以用某种尺度来测量，并可用数字形式来描述，比如果蝇的的身体大小、生长速度、小刚毛数量的多少等，这类性状叫做数量性状（quantitative
      character）。一个显示数量性状的个体，其表型是受到多个不同等位基因的作用，而每个等位基因对表型的贡献很小，但相关基因数目很多。此外，数量性状除了基因型的作用外，环境因素对表型的分布也产生显著影响[2]。因此，对影响数量性状的单个等位基因的分离，以及用普通遗传学方法去追查各个基因的行为都是困难的，故通常不能够用孟德尔的分析方法进行分析，而应用数理统计的方法进行分析[3]。

    </div>
  </div>
}

export default bristles
